src/PAIP2clojure/Chapter4.org
#+TITLE:Porting PAIP to clojure - Chapter 4: GPS - The General Problem Solver
#+AUTHOR: Maik Schünemann
#+email: maikschuenemann@gmail.com
#+BABEL: :results output :exports both :tangle yes
#+STARTUP:showall
-----
#+begin_src clojure :results silent :exports none
    
#+end_src 
* PAIP to clojure - chapter 4
  I continue to translate PAIP to clojure.
  As always, it is possible to follow the post even without reading PAIP, but I encourage you to do so.
  This chapter covers the GPS program, the
  General Problem Solver. As always, the focus lies on the iterative process of developing
  an (ai-) progam. Norvig presents 5 stages of an programming project, after which the
  sections of the chapter are numbered:
  1. Description
  2. Specification (in algorithmic terms) 
  3. Implementation                     
  4. Testing                            
  5. Debugging/Analysis (optional repeat)

** Description
   GPS was the first program which separated its problem-solving strategy from its knowledge of particular
   problems. It used [[http://en.wikipedia.org/wiki/Means-ends_analysis][means-ends analysis]] as problem-solving strategy. In means-ends analysis, you know in what
   state you are right now and in what state you will be when you have solved your problem, but you consider
   what is between your state now and the goal-state and how this distance can be overcome.
   An Example:
   I have to write a blog-post. What Do I need to do to write an blog-post? I have to type it.
   What do I need to type it? I have to sit in front of my pc.
   What do I need to do to sit in front of my pc ? Go to the PC ....

   It is obvious that we have to be able to answer "What do I need to  ... "or, like the book points out "What is the
   difference between..." from the set of all possible actions. And each actions could have itself preconditions,
   for  which actions have to be taken befor it can be taken.
   This is a very brief description, I encourage you to read the section in PAIP for the full discussion.
** Specification
   After having a (rough) Idea of how the means-ends analysis works, it is time to come to the second step: specification.
   In this stage, we refine the description to something that is representible in the implementation language.
   I tink, the stage of specification is best described as follows:
   Find the most natural mapping between the problem and the implementation language!

   So, let's see how means-ends analysis can be represented in clojure:
    - A state can be represented as a set of conditions, for example #{unknown poor} and #{rich famous}. We need 2 states:
     the current state and the goal state (try to guess which of the two above is the goal-state...?)
    - The allowable actions can naturally be represented as a collection of actions, which can be worke
    - An action needs a Name, a descriptions of what states a person has to be in in order to take the action and
      a description of what states of the person will change after taking the action. 
      An action can therefore be described by a map (or later by a record) with a :action and a :precond field. 
      The changes of the state of the acting person are trickier. Consider an action "Become rich" that has as precond
      being poor and changes that to being rich. It could also remove states or add new ones. The change of one 
      state to the other can easily be represented in terms of removing the old one and adding the new one.
      Thus the Action will have two more fields, a :del-list and a :add-list which contains states which will 
      be added or removed from the current state after taking the action.
    - Last, but not least, we have to specify the entry point of the application, the GPS-function.
      We need a start-state, a goal-state and the allowed actions. It can be represented as a function which
      takes a start-state and a goal states, and works with the *ops* var.
   
  Now we have specified the single entities of the program. The algorithm is next to go:
  GPS succeeds, if it can achieve all single conditions in the goal state by applying a sequence of actions.
  To decide, wheter to apply an action or not, we have to look in its add list. If a goal-condition is in the
  add-list, the action is appropriate and GPS wants to take the action. It can only take the action, if it can achieve
  all preconds of the action, which is just calling itself with the preconds as goal-state, updating the current
  state as it goes along. If it was able to achieve every condition of the goal state, it succeedes
  (Note that this is the first, most simplest specification, it will be refined in part 2).
  Ok, this is enough for the first implementation of the program!
