src/PAIP2clojure/Chapter4.org
** Implementation
     First, let's have a look at a sample operations list. I find it easier to implement the program, if I see
     with what data it works with:
     #+begin_src clojure :results output :exports both
     (ns PAIP2clojure.Chapter4)

     (def school-ops
      [ {:action "drive-son-to-school"
         :preconds #{ "son-at-home" "car-works"}
         :add-list #{ "son-at-school"}
         :del-list #{ "son-at-home"}}
        {:action "shop-installs-battery"
         :preconds #{"car-needs-battery" "shop-knows-problem" "shop-has-money"}
         :add-list #{"car-works"}}
        {:action "tell-shop-problem"
         :preconds #{"in-communication-with-shop"}
         :add-list #{"shop-knows-problem"}}
        {:action "telephone-shop"
         :preconds #{"know-phone-number"}
         :add-list #{"in-communication-with-shop"}}
        {:action "look-up-number"
         :preconds #{"have-phone-book"}
         :add-list #{"know-phone-number"}}
        {:action "give-shop-money"
         :preconds #{"have-money"}
         :add-list #{"shop-has-money"}
         :del-list #{"have-money"}}])
     (def ^:dynamic *ops* school-ops)
   #+end_src 

     #+RESULTS:
     : => #'PAIP2clojure.Chapter4/*ops*

  In the implementation, I choose not follow Norvigs route and
  modify the current state in the function, which would require something like an atom or agent in clojure.
  Instead I changed the implementation to be side-effect free and hence more ideomatic clojure.
  Here is the implementation from the book:
  #+begin_src common-lisp :exports both :results output
  (defvar *state* nil "The current state: a list of conditions.")

  (defvar *ops* nil "A list of available operators.")
  
  (defstruct op "An operation"
    (action nil) (preconds nil) (add-list nil) (del-list nil))
  
  (defun GPS (*state* goals *ops*)
    "General Problem Solver: achieve all goals using *ops*."
    (if (every #'achieve goals) 'solved))
  
  (defun achieve (goal)
    "A goal is achieved if it already holds,
    or if there is an appropriate op for it that is applicable."
    (or (member goal *state*)
        (some #'apply-op 
              (find-all goal *ops* :test #'appropriate-p))))
  
  (defun appropriate-p (goal op)
    "An op is appropriate to a goal if it is in its add list."
    (member goal (op-add-list op)))
  
  (defun apply-op (op)
    "Print a message and update *state* if op is applicable."
    (when (every #'achieve (op-preconds op))
      (print (list 'executing (op-action op)))
      (setf *state* (set-difference *state* (op-del-list op)))
      (setf *state* (union *state* (op-add-list op)))
      t))
  #+end_src
  I had to change the return value of achieve and apply-op to an updated current-state instead of returning
  a truth value and destructively modifying the current state as side effect.
  Also, I couldn't use every? because the state has to be updated after every application of achieve.
  Thus I made a helper function every-accum? which takes a 2-argument function a start-state and a collection
  and reduces the collection applying the function. When the result is nil, the function returns nil.

  Notice the use of the with-auto-declare macro which I described in a previous post. This let me avoid
  to add a declare binding everytime I make a forward declaration. If a symbol starts with _, a forward-declaration
  will be automagically added for it.
  #+begin_src clojure :exports both :results output
   (use 'clojure.set)
   (use 'auto-declare.core)
  
  (with-auto-declare _  
     (defn GPS [state goals]
       (let [new-state (_every-accum? _achieve state goals)]
         (if (nil? new-state)
           'not-solved
           'solved)))

     (defn achieve
       "return the new-state after the goal is achieved or nil
        if it could not be archieved"
       [current-state goal]
       (if (contains? current-state goal)
         current-state
          (some (partial _apply-op current-state)
            (filter #(_appropriate? goal %) *ops*))))
    
     (defn appropriate? [goal op]
       (contains? (:add-list op) goal))
        
     (defn every-accum? [func start coll]
       (reduce #(if (nil? %1)
                  nil
                  (func %1 %2)) start coll))
     
     (defn apply-op [current-state op]
       (let [new-current-state (every-accum? achieve current-state (:preconds op))]
         (if (nil? new-current-state)
           nil
           (do (println (str "executing " (:action op)))
               (-> new-current-state (difference (:del-list op)) (union (:add-list op))))))))
   #+end_src
  #+RESULTS:
 : => #'PAIP2clojure.Chapter4/apply-op
  Ok, now comes the 4. stage: Testing
