src/PAIP2clojure/Chapter4.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Implementation</h3>
<div class="outline-text-3" id="text-1-3">

<p>     First, let's have a look at a sample operations list. I find it easier to implement the program, if I see
     with what data it works with:
</p>


<pre class="src src-clojure">(<span style="color: #b0c4de;">ns</span> PAIP2clojure.<span style="color: #b0c4de;">Chapter4</span>)

(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">school-ops</span>
 [ {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"drive-son-to-school"</span>
    <span style="color: #7fffd4;">:preconds</span> #{ <span style="color: #ffa07a;">"son-at-home"</span> <span style="color: #ffa07a;">"car-works"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{ <span style="color: #ffa07a;">"son-at-school"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{ <span style="color: #ffa07a;">"son-at-home"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"shop-installs-battery"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"car-needs-battery"</span> <span style="color: #ffa07a;">"shop-knows-problem"</span> <span style="color: #ffa07a;">"shop-has-money"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"car-works"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"tell-shop-problem"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"in-communication-with-shop"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"shop-knows-problem"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"telephone-shop"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"know-phone-number"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"in-communication-with-shop"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"look-up-number"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"have-phone-book"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"know-phone-number"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"give-shop-money"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"have-money"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"shop-has-money"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"have-money"</span>}}])
(<span style="color: #00ffff;">def</span> <span style="color: #7fffd4;">^:dynamic</span> <span style="color: #87cefa;">*ops*</span> school-ops)
</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter4/*ops*
</pre>


<p>
  In the implementation, I choose not follow Norvigs route and
  modify the current state in the function, which would require something like an atom or agent in clojure.
  Instead I changed the implementation to be side-effect free and hence more ideomatic clojure.
  Here is the implementation from the book:
</p>


<pre class="src src-common-lisp">(<span style="color: #00ffff;">defvar</span> <span style="color: #eedd82;">*state*</span> nil <span style="color: #ffa07a;">"The current state: a list of conditions."</span>)

(<span style="color: #00ffff;">defvar</span> <span style="color: #eedd82;">*ops*</span> nil <span style="color: #ffa07a;">"A list of available operators."</span>)

(<span style="color: #00ffff;">defstruct</span> <span style="color: #98fb98;">op</span> <span style="color: #ffa07a;">"An operation"</span>
  (action nil) (preconds nil) (add-list nil) (del-list nil))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">GPS</span> (*state* goals *ops*)
  <span style="color: #ffa07a;">"General Problem Solver: achieve all goals using *ops*."</span>
  (<span style="color: #00ffff;">if</span> (every #'achieve goals) 'solved))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">achieve</span> (goal)
  <span style="color: #ffa07a;">"A goal is achieved if it already holds,</span>
<span style="color: #ffa07a;">  or if there is an appropriate op for it that is applicable."</span>
  (or (member goal *state*)
      (some #'apply-op 
            (find-all goal *ops* <span style="color: #b0c4de;">:test</span> #'appropriate-p))))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">appropriate-p</span> (goal op)
  <span style="color: #ffa07a;">"An op is appropriate to a goal if it is in its add list."</span>
  (member goal (op-add-list op)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">apply-op</span> (op)
  <span style="color: #ffa07a;">"Print a message and update *state* if op is applicable."</span>
  (<span style="color: #00ffff;">when</span> (every #'achieve (op-preconds op))
    (print (list 'executing (op-action op)))
    (setf *state* (set-difference *state* (op-del-list op)))
    (setf *state* (union *state* (op-add-list op)))
    t))
</pre>

<p>
  I had to change the return value of achieve and apply-op to an updated current-state instead of returning
  a truth value and destructively modifying the current state as side effect.
  Also, I couldn't use every? because the state has to be updated after every application of achieve.
  Thus I made a helper function every-accum? which takes a 2-argument function a start-state and a collection
  and reduces the collection applying the function. When the result is nil, the function returns nil.
</p>
<p>
  Notice the use of the with-auto-declare macro which I described in a previous post. This let me avoid
  to add a declare binding everytime I make a forward declaration. If a symbol starts with _, a forward-declaration
  will be automagically added for it.
</p>


<pre class="src src-clojure"> (<span style="color: #eedd82;">use</span> 'clojure.set)
 (<span style="color: #eedd82;">use</span> 'auto-declare.core)

(with-auto-declare _  
   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">GPS</span> [state goals]
     (<span style="color: #b0c4de;">let</span> [new-state (_every-accum? _achieve state goals)]
       (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">nil?</span> new-state)
         'not-solved
         'solved)))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">achieve</span>
     <span style="color: #ffa07a;">"return the new-state after the goal is achieved or nil</span>
<span style="color: #ffa07a;">      if it could not be archieved"</span>
     [current-state goal]
     (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">contains?</span> current-state goal)
       current-state
        (<span style="color: #eedd82;">some</span> (<span style="color: #eedd82;">partial</span> _apply-op current-state)
          (<span style="color: #eedd82;">filter</span> #(_appropriate? goal %) *ops*))))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">appropriate?</span> [goal op]
     (<span style="color: #eedd82;">contains?</span> (<span style="color: #7fffd4;">:add-list</span> op) goal))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">every-accum?</span> [func start coll]
     (<span style="color: #eedd82;">reduce</span> #(<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">nil?</span> %1)
                nil
                (func %1 %2)) start coll))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">apply-op</span> [current-state op]
     (<span style="color: #b0c4de;">let</span> [new-current-state (every-accum? achieve current-state (<span style="color: #7fffd4;">:preconds</span> op))]
       (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">nil?</span> new-current-state)
         nil
         (<span style="color: #b0c4de;">do</span> (<span style="color: #eedd82;">println</span> (<span style="color: #eedd82;">str</span> <span style="color: #ffa07a;">"executing "</span> (<span style="color: #7fffd4;">:action</span> op)))
             (<span style="color: #b0c4de;">-&gt;</span> new-current-state (<span style="color: #98fb98;">difference</span> (<span style="color: #7fffd4;">:del-list</span> op)) (<span style="color: #98fb98;">union</span> (<span style="color: #7fffd4;">:add-list</span> op))))))))
</pre>

<pre class="example">
=&gt; #'PAIP2clojure.Chapter4/apply-op
</pre>

<p>  Ok, now comes the 4. stage: Testing
</p></div>

</div>
