src/PAIP2clojure/Chapter4.html

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Analysis</h3>
<div class="outline-text-3" id="text-1-5">

<p>   It turns out, that the GPS is not very general, at least our implementation is not.
   Norvig does a great analysis explaining the reasons why the program can not handle many situations.
   I will give a short summary of the discussion, describing the problems and a miminal explanation why the program fails.
</p><ul>
<li>Running around the block - GPS don't have any notion of actions, that add nothing to the :add-list, like
     'running-around-the-block'. There has to be a state like "got-some-exercise" in the :add-list
</li>
<li>Clobbered Sibling Goal - In the current implementation, GPS solves every goal independent and in sequence.
     That means, if solving the second problem undoes a previous goal, GPS will falsly return success.
     In the school-ops world, consider #{have-money son-at-school}.
     The program has to be modified, so that it checks after achieving all goals that the state is still a subset 
     of the goal-state
</li>
<li>Leaping before you look - sometimes, gps will fail, but executes some action before it recognizes that.
     In the current implementation, planning and execution are interleaved. This will be addressent by returning
     the list of actions instead of just printing the actions.
</li>
<li>Recursive Subgoal Problem - suppose we would add another operator to the school-ops "ask-phone-number" with
     the precondition of being in communication with the shop. GPS will try to achieve know-phone-number with 
     ask-phone-number, which requires to be in communication with the shop, which requires knowing the phone-number
     &hellip; It tries to solve the problem in terms of itself. To address this, we have to add a goal-stack, and let
     GPS give-up if it recognizes a circle.
</li>
<li>Lack of Intermediate Information - As at the leaping before you look problem, it is better to return a list
     of actions instead of just solved. This makes it easier for other parts of the program to interact with GPS
</li>
</ul>


</div>

</div>
