src/PAIP2clojure/Chapter4.html

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Back to implementation - A more general version 2</h3>
<div class="outline-text-3" id="text-1-6">

<p>   Before we come to the implementation of the program, it helps to get a good debugging tool, so that we can
   see what it is doing:
</p>


<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #7fffd4;">^:dynamic</span> <span style="color: #87cefa;">*dbg-ids*</span>)
(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">debug</span>
  ([id str] (debug id 0 str))
  ([id indent str]
   (<span style="color: #b0c4de;">when</span> (<span style="color: #eedd82;">contains?</span> *dbg-ids* id)
    (<span style="color: #b0c4de;">do</span> (<span style="color: #b0c4de;">dotimes</span> [i indent]
          (<span style="color: #eedd82;">print</span> <span style="color: #ffa07a;">" "</span>))
        (<span style="color: #eedd82;">println</span> str)))))
</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter4/debug
</pre>


<p>
   Here is the common-lisp code. It first transforms all the ops to a new form, which has an '(Executing action)
   in its add list.
</p>


<pre class="src src-common-lisp">   (<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">executing-p</span> (x)
  <span style="color: #ffa07a;">"Is x of the form: (executing ...) ?"</span>
  (starts-with x 'executing))

  (<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">starts-with</span> (list x)
    <span style="color: #ffa07a;">"Is this a list whose first element is x?"</span>
    (and (consp list) (eql (first list) x)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">convert-op</span> (op)
  <span style="color: #ffa07a;">"Make op conform to the (EXECUTING op) convention."</span>
  (<span style="color: #00ffff;">unless</span> (some #'executing-p (op-add-list op))
    (push (list 'executing (op-action op)) (op-add-list op)))
  op)

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">op</span> (action <span style="color: #98fb98;">&amp;key</span> preconds add-list del-list)
  <span style="color: #ffa07a;">"Make a new operator that obeys the (EXECUTING op) convention."</span>
  (convert-op
    (make-op <span style="color: #b0c4de;">:action</span> action <span style="color: #b0c4de;">:preconds</span> preconds
             <span style="color: #b0c4de;">:add-list</span> add-list <span style="color: #b0c4de;">:del-list</span> del-list)))

<span style="color: #ff7f24;">;;; </span><span style="color: #ff7f24;">==============================</span>

(mapc #'convert-op *school-ops*)

</pre>

<p>
   The new version of GPS will return the new state instead of printing the actions and removes all non-atoms from
   the state so that only (Executing action) forms are left
</p>



<pre class="src src-common-lisp">  (<span style="color: #00ffff;">defvar</span> <span style="color: #eedd82;">*ops*</span> nil <span style="color: #ffa07a;">"A list of available operators."</span>)

(<span style="color: #00ffff;">defstruct</span> <span style="color: #98fb98;">op</span> <span style="color: #ffa07a;">"An operation"</span>
  (action nil) (preconds nil) (add-list nil) (del-list nil))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">GPS</span> (state goals <span style="color: #98fb98;">&amp;optional</span> (*ops* *ops*))
  <span style="color: #ffa07a;">"General Problem Solver: from state, achieve goals using *ops*."</span>
  (remove-if #'atom (achieve-all (cons '(start) state) goals nil)))


(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">achieve-all</span> (state goals goal-stack)
  <span style="color: #ffa07a;">"Achieve each goal, and make sure they still hold at the end."</span>
  (<span style="color: #00ffff;">let</span> ((current-state state))
    (<span style="color: #00ffff;">if</span> (and (every #'(<span style="color: #00ffff;">lambda</span> (g)
                        (setf current-state
                              (achieve current-state g goal-stack)))
                    goals)
             (subsetp goals current-state <span style="color: #b0c4de;">:test</span> #'equal))
        current-state)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">achieve</span> (state goal goal-stack)
  <span style="color: #ffa07a;">"A goal is achieved if it already holds,</span>
<span style="color: #ffa07a;">  or if there is an appropriate op for it that is applicable."</span>
  (dbg-indent <span style="color: #b0c4de;">:gps</span> (length goal-stack) <span style="color: #ffa07a;">"Goal: ~a"</span> goal)
  (<span style="color: #00ffff;">cond</span> ((member-equal goal state) state)
        ((member-equal goal goal-stack) nil)
        (t (some #'(<span style="color: #00ffff;">lambda</span> (op) (apply-op state goal op goal-stack))
                 (find-all goal *ops* <span style="color: #b0c4de;">:test</span> #'appropriate-p)))))


(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">member-equal</span> (item list)
  (member item list <span style="color: #b0c4de;">:test</span> #'equal))


(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">apply-op</span> (state goal op goal-stack)
  <span style="color: #ffa07a;">"Return a new, transformed state if op is applicable."</span>
  (dbg-indent <span style="color: #b0c4de;">:gps</span> (length goal-stack) <span style="color: #ffa07a;">"Consider: ~a"</span> (op-action op))
  (<span style="color: #00ffff;">let</span> ((state2 (achieve-all state (op-preconds op) 
                             (cons goal goal-stack))))
    (<span style="color: #00ffff;">unless</span> (null state2)
      <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Return an updated state</span>
      (dbg-indent <span style="color: #b0c4de;">:gps</span> (length goal-stack) <span style="color: #ffa07a;">"Action: ~a"</span> (op-action op))
      (append (remove-if #'(<span style="color: #00ffff;">lambda</span> (x) 
                             (member-equal x (op-del-list op)))
                         state2)
              (op-add-list op)))))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">appropriate-p</span> (goal op)
  <span style="color: #ffa07a;">"An op is appropriate to a goal if it is in its add list."</span>
  (member-equal goal (op-add-list op)))
</pre>


<p>
  The function achieve-all abstracts away the (every #'achieve &hellip;) from the first version and checks whether
  the resulting state is still a subset of the goal-state. Also, it updates the current state for each application
  of achieve (destructively modifying..)
</p>
<p>
  Also note, that in apply-op append and remove-if are used. They are needed because in this version, the order
  of the conditions in the current state counts (because they contain (Executing action) elements.
</p>
<p>
  Again, I will not follow the implementation given in PAIP. Especially I want to avoid the side-effects in
  achieve-all and the mixing of actual conditions and (Executing action) forms, which would prevent to represent
  states with sets. It turned out, that I needed only three small changes from the first version of the program:
</p>
<ul>
<li>The state is now divided in the current-state and a list-of-actions taken so far. Thanks to clojure's destructuring,
    it is easy to take the state apart again.
</li>
<li>there is a goal-stack which contains all goals tried so far. achieve gives up if it encounters a goal that is 
    in the goal-stack to avoid stack-overflow-errors.
</li>
<li>every-time an action is executed, it is appendet to the list-of-actions.
</li>
</ul>





<pre class="src src-clojure"> (<span style="color: #eedd82;">use</span> 'clojure.set)
 (<span style="color: #eedd82;">use</span> 'auto-declare.core)

(with-auto-declare _  
   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">GPS</span> [state goals]
     (<span style="color: #b0c4de;">let</span> [[new-state list-of-actions] (_every-accum? (<span style="color: #eedd82;">partial</span> achieve []) [state []] goals)]
       (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">nil?</span> new-state)
         nil
         list-of-actions)))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">achieve</span>
     <span style="color: #ffa07a;">"return the new-state after the goal is achieved or nil</span>
<span style="color: #ffa07a;">      if it could not be archieved"</span>
     [goal-stack [current-state list-of-actions] goal]
     (debug <span style="color: #7fffd4;">:gps</span> (<span style="color: #eedd82;">count</span> goal-stack) (<span style="color: #eedd82;">str</span> <span style="color: #ffa07a;">"Goal "</span> goal))
     (<span style="color: #b0c4de;">cond</span> (<span style="color: #eedd82;">contains?</span> current-state goal) [current-state list-of-actions]
           (<span style="color: #eedd82;">contains?</span> goal-stack goal) [nil list-of-actions]
           <span style="color: #7fffd4;">:else</span> (<span style="color: #eedd82;">some</span> (<span style="color: #eedd82;">partial</span> _apply-op goal-stack goal [current-state list-of-actions])
                       (<span style="color: #eedd82;">filter</span> #(_appropriate? goal %) *ops*))))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">appropriate?</span> [goal op]
     (<span style="color: #eedd82;">contains?</span> (<span style="color: #7fffd4;">:add-list</span> op) goal))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">every-accum?</span> [func start coll]
     (<span style="color: #eedd82;">reduce</span> #(<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">nil?</span> %1)
                nil
                (func %1 %2)) start coll))

   (<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">apply-op</span> [goal-stack goal state op]
     (debug <span style="color: #7fffd4;">:gps</span> (<span style="color: #eedd82;">count</span> goal-stack) (<span style="color: #eedd82;">str</span> <span style="color: #ffa07a;">"Consider: "</span> (<span style="color: #7fffd4;">:action</span> op)))
     (<span style="color: #b0c4de;">let</span> [[new-current-state new-list-of-actions](every-accum? (<span style="color: #eedd82;">partial</span> achieve (<span style="color: #eedd82;">conj</span> goal-stack goal))
                                                                state (<span style="color: #7fffd4;">:preconds</span> op))]
       (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">nil?</span> new-current-state)
         [nil new-list-of-actions]
         (<span style="color: #b0c4de;">do</span> (debug <span style="color: #7fffd4;">:gps</span> (<span style="color: #eedd82;">count</span> goal-stack) (<span style="color: #eedd82;">str</span> <span style="color: #ffa07a;">"Action "</span> (<span style="color: #7fffd4;">:action</span> op)))
             [(<span style="color: #b0c4de;">-&gt;</span> new-current-state (<span style="color: #98fb98;">difference</span> (<span style="color: #7fffd4;">:del-list</span> op)) (<span style="color: #98fb98;">union</span> (<span style="color: #7fffd4;">:add-list</span> op)))
              (<span style="color: #eedd82;">conj</span> new-list-of-actions (<span style="color: #7fffd4;">:action</span> op))])))))

</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter4/apply-op
</pre>


<p>
  This implementation solves the problems mentioned above.
  The next parts of Chapter 4 show how the program performs in new domains. Feel free to port the
  ops in these domains to clojure and report whether the program worked or not.
  Here is one example domain: monkey and bananas:
</p>


<pre class="src src-clojure">  (<span style="color: #00ffff;">def</span> <span style="color: #7fffd4;">^:dynamic</span> <span style="color: #87cefa;">*banana-ops*</span>
  [{<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"climb-on-chair"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"chair-at-middle-room"</span> <span style="color: #ffa07a;">"at-middle-room"</span> <span style="color: #ffa07a;">"on-floor"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"at-bananas"</span> <span style="color: #ffa07a;">"on-chair"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"at-middle-room"</span> <span style="color: #ffa07a;">"on-floor"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"push-chair-from-door-to-middle-room"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"chair-at-door"</span> <span style="color: #ffa07a;">"at-door"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"chair-at-middle-room"</span> <span style="color: #ffa07a;">"at-middle-room"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"chair-at-door"</span> <span style="color: #ffa07a;">"at-middle-room"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"walk-from-door-to-middle-room"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"at-door"</span> <span style="color: #ffa07a;">"on-floor"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"at-middle-room"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"at-door"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"grasp-bananas"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"at-bananas"</span> <span style="color: #ffa07a;">"empty-handed"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"has-bananas"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"at-door"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"drop-ball"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"has-ball"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"empty-handed"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"has-ball"</span>}}
   {<span style="color: #7fffd4;">:action</span> <span style="color: #ffa07a;">"eat-bananas"</span>
    <span style="color: #7fffd4;">:preconds</span> #{<span style="color: #ffa07a;">"has-bananas"</span>}
    <span style="color: #7fffd4;">:add-list</span> #{<span style="color: #ffa07a;">"empty-handed"</span> <span style="color: #ffa07a;">"not-hungry"</span>}
    <span style="color: #7fffd4;">:del-list</span> #{<span style="color: #ffa07a;">"has-bananas"</span> <span style="color: #ffa07a;">"hungry"</span>}}])

(<span style="color: #00ffff;">def</span> <span style="color: #7fffd4;">^:dynamic</span> <span style="color: #87cefa;">*ops*</span> *banana-ops*)
</pre>


<pre class="example">
=&gt; #'PAIP2clojure.Chapter4/*ops*
</pre>





<pre class="src src-clojure">(<span style="color: #b0c4de;">binding</span> [*dbg-ids* #{<span style="color: #7fffd4;">:gps</span> }]
  (GPS #{<span style="color: #ffa07a;">"at-door"</span> <span style="color: #ffa07a;">"on-floor"</span> <span style="color: #ffa07a;">"has-ball"</span> <span style="color: #ffa07a;">"hungry"</span> <span style="color: #ffa07a;">"chair-at-door"</span>}
       #{<span style="color: #ffa07a;">"not-hungry"</span>}))
</pre>


<pre class="example">
 Goal not-hungry
 Consider: eat-bananas
  Goal has-bananas
  Consider: grasp-bananas
   Goal empty-handed
   Consider: drop-ball
    Goal has-ball
   Action drop-ball
   Goal at-bananas
   Consider: climb-on-chair
    Goal chair-at-middle-room
    Consider: push-chair-from-door-to-middle-room
     Goal chair-at-door
     Goal at-door
    Action push-chair-from-door-to-middle-room
    Goal at-middle-room
    Goal on-floor
   Action climb-on-chair
  Action grasp-bananas
 Action eat-bananas
=&gt; ["drop-ball" "push-chair-from-door-to-middle-room" "climb-on-chair" "grasp-bananas" "eat-bananas"]
</pre>



<p>
  The Chapter in PAIP ends with a discussion of how general the gps really is. It turns out that it has severe
  limitations and I encourage everyone to read the sections in the book. Many of this issues will be addressed
  in later chapters using more sophisticated techniques like full-fledged search and backtracking, like
  prolog does.
</p>
<p>
  Puh, that was more work than I thought. But I hope that I managed to translate it to ideomatic clojure which is not
  to hard to follow.
  Feel free to comment, if you have questions, anything is not clear, you enounter bugs or have some other advice.
</p>
<p>
  Chapter 5 is next to come. It contains an implementation of the ELIZA program.
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-02T19:24+0200</p>
<p class="author">Author: Maik Schünemann</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
